[["0",{"pageContent":"Hello friends, welcome back to my youtube channel, Basic or ServiceNow Learning. So in this video is the first video of ServiceNow training session or I can say ServiceNow training series. A series where we will cover each and every topic mentioned in this syllabus. So I will be covering all these topics one by one in videos. So in today's video I am going to cover this first and second, the introduction to ServiceNow, the configuring users and groups and administration. So the first part is basically a theoretical and the second part is basically a implementation in ServiceNow instance that how to create users, how to create groups, how to create roles, what is users, what are groups, what are roles in ServiceNow. So let's see what we are going to cover in this video. In this video I will give you a brief of ServiceNow, basically ServiceNow introduction. We will talk about users, we will talk about roles, we will talk about groups and we will also implement a use case. The use case is like how to create a user, how to create a custom roles, how to create a groups in ServiceNow, how to assign roles to user directly, how to assign roles to group, how to add user to group. If we are adding a role right,","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["1",{"pageContent":"so we have to remove the role as well. So how to remove role from the users and how to remove roles from the groups. So these are all use cases we are going to cover in today's video. So let's start with ServiceNow introduction. So that is basically a theoretical part. So ServiceNow is basically a product of ServiceNow Inc. which is an American cloud based IT management company. It was founded in 2004 by Fred Lutti and its headquarters is in Santa Clara, California. ServiceNow is a cloud based IT management tool which is used to automate business processes and provides best service to customers and encourages best practices in managing all services as a business. ServiceNow was first introduced as ITSM tool used for various IT activities such as asset management, incident management, change management, problem management, knowledge management, CMDB etc. So basically these incident management, change management, asset management, problem management, these are basically ITSM applications. These are the very basic applications or default applications which is given by ServiceNow and most of the companies are working on incident management, change management I believe. So","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["2",{"pageContent":"these are the very basic modules, incident management and change management. But now ServiceNow becomes huge and serves a lot of other applications as well such as ITOM applications and ITBM applications. So as we move forward with other training sessions, then we will also cover ITOM applications and ITBM applications. What all ITOM applications ServiceNow have, what all ITBM applications ServiceNow have. We will also talk about these ITSM applications in details, what exactly the incident management process is, what exactly the change management process is, problem management process and all. So we will cover all these things in later videos as well. So this is basically introduction session of ServiceNow. So we are only covering these theoretical sections only. ServiceNow platform supports several database technologies such as MySQL, Oracle etc. ServiceNow platform is written in Java, apps are written in JavaScript. So if you are learning ServiceNow, you should have a basic knowledge of JavaScript, you must have a basic knowledge of AngularJS, you must have a basic knowledge of HTML and CSS at least. If you want to proceed your career in ServiceNow development, but","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["3",{"pageContent":"if you are proceeding your career in ServiceNow administration or if you are proceeding your career in ServiceNow functional consultant, so doesn't mean that you know JavaScript or not. So let's see. So this is basically a very brief introduction of ServiceNow because most of the time interviewers ask like what is ServiceNow, so at least you should be aware of what is ServiceNow, what exactly the tool is. This tool is basically for ITSM, ITBM and ITOM applications. It's a cloud based IT management tool. So here, now let's see what is users. So you know that each and every application, either it is a software, it is a web application or any application, so it is nothing without users. In ServiceNow, user is basically those individuals who can access ServiceNow instance and to create users in ServiceNow, user admin or ITIL role is required. So let's navigate to ServiceNow application so that we can understand how we can create users and from where we can create users. So friends, this is my ServiceNow personal developer instance. If you are not aware of what is a personal development instance, so I will tell you that this is basically an instance which is provided by ServiceNow. This is","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["4",{"pageContent":"free of cost. You can create your access and you can create your instance directly. So I have already posted a video, you can check it in my playlist, so where you can find out how to create your personal developer instance. So you can create your personal developer instance. Once you create that, then you have an admin access of that instance. See, and then you can perform the activities which I am going to perform. And you can also explore the things of ServiceNow instance. So we are talking about users. So before we start with users, I'll give you a little brief on this application first. See whatever we are looking here in the left hand side navigation, see these are the applications which are provided by ServiceNow. By default is this personal development instance. There are lots of applications. See I was talking about change earlier, right? Change, problem, incidency, you have access here. You can access those applications, you can do hands-on if you want to become an incident manager or you want to become a problem manager or change manager, you can do hands-on over here. We have different applications here, even though we have development applications also here. So if you want to","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["5",{"pageContent":"do development in ServiceNow, you need an admin access from where you can access the applications like system definition. See from here we can do development activities. There are lots of other applications as well. So these are the applications which are provided by ServiceNow. On the left hand navigation, each and every application has different modules. Modules means like in incident we have module called create new. It's basically used to create an incident, assign to me is a different list view and this open is basically a list view. So we have different modules available in each and every application. Each and every module is for performing different activities. Same as here we have profile, impersonate user, elevate role. Here we have settings which tell us that what updates we are using in development sections, what applications we are using, right? Like notifications, if you want to create some personal notifications or remove some notifications then you can use it from here. Forms, lists, themes, journals. This is basically a search, we can say global search. You can search anything from here. Whatever data is available in ServiceNow will be displayed to you. So this","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["6",{"pageContent":"is basically ServiceNow application. So when we move forward with different tutorials or different training sessions, then you will be come to know more about each and everything. So now let's move to user part first. So to create a user or to find out from where to create a user, tap user in this filter navigator. Once you tap user, see it gives us a filter result. So scroll down under user administration, see we have a modules called users, groups and roles. So we are going to cover these users, groups and roles. So what I am going to do, I am going to open this user in a new tab. See we have 590 users in this system right now. We are going to create more users today. So from here we can create a new user. This icon is basically for personalizing the list. What all columns you want to display. Like this is the selected columns, if you want to add more columns, we can add from here. So first name, so see this first name come over here. I am just setting it to position where I want to display it. I say ok. Once I personalize the list, see the first name is displaying over here. So it means this particular gear icon is used to customize this. What you want to see, what you want to remove from here. And this is basically","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["7",{"pageContent":"filter vision that what all records you can create your own query over here. Let's say I am saying that active is true. Means those users are active. Active is true, display to me. So it will display me all the users those who are active. So it will filter the results. So this is basically used for filtration. This is basically used for personalization. So these two functionality you will get for each and every list view in service now. So now let's come back to users. So I am going to create a new user. Click on this new button. So once you click on new button, see we have a form available. So we have to fill this form. So as I told you that earlier that to create a user a person need a ITIL role or a user underscore admin role to create a user. So user ID is basically a login ID. So I am giving a demo, so I am saying demo user. The first name is first, last name is demo. The name you can give any name. Title if you want to give, this is not mandatory. So I am not giving it. See this is mandatory and this is not mandatory. Department I am not giving, I am saying password 123. Password need reset. If I checked it, it means when the person login the system, this user first time login the system then he need to reset the password.","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["8",{"pageContent":"This logged out basically if I checked it, it means user is active in the system but he cannot do any login. If I click on this, this basically happens like if a person enters a password more than three times, a wrong password, then the system get locked out. Means he had to reset the password and then he can login to the system. Active is basically means he is in the organization, he is active user. If I unchecked it, it means that he is not active, so he is no more in the organization. So basically when the person gave an interview for system administration, then interviewer ask them what is the difference between a locked out and an active or inactive. So person has to explain that locked out user is basically the user who is active in the system but anyhow he cannot login to the system. And inactive means that person is no more in the organization. Here we have web service access only, if we are doing some integration or something and we don't want to give a interface access, only web service access, then we can use these check boxes. Email id of a user, I am saying like demo user, at the rate demo.com. Manager, if you want to give a manager of a person, then you can give a name accordingly. Language,","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["9",{"pageContent":"calendar integration, time zone, that you can select accordingly. Business, I have given the business phone, mobile phone. Now I am just saving it. See once I clicked on save, data get saved and new more related list and related links get introduced. So here is the list of roles, we can give a role to a particular person, we can give a role from here, we can click on edit button. We can see what role we want to give to a user, we can select a role from here, let's say this and then move this role by using this and then we can give a role to a user. When we save this, then this role is assigned to that user. So currently I am not giving a role because first we have an understanding of role and then we can work on this giving a role and all. So currently I am only creating a user. See it is not assigned to any group, so that's why the group is not mentioned over here. So in this way we can create a user. So see I have not given any role to a user even though I have not assigned this user to any group. So let's log in with this user, let's see what kind of interface he can see. So I copy this user ID and I am logging to this instance through this user. So here, the password was 123, I am just clicking on login. See, this person now has","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["10",{"pageContent":"access of a ServiceNow instance. But the application which is available for him is only self-service, password is set, connect, live feed. Self-service is basically kind of like an employee self-service through which he can create a request, through which he can work on knowledge or he can create a quotient or something and there are some other like incident to create an incident. So he can create the tickets like request, incident, knowledge for himself only. He cannot work for others through this access. So here the person does not have any role, so he is an ESS user only, without any role. Now this is a user, now let's talk about roles. So same as in user administration, see we have roles or you can type role over here, the same menu you will get. So let's open this role and do new tab. See we have different roles available over here. So role is basically to specify that what different users and user group can see and do in ServiceNow instance. So from here we can create a new role. So in ServiceNow there are different types of roles such as like base system roles, special administrator roles, custom roles and read-only roles. So base system role is a role which is by default provided by","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["11",{"pageContent":"ServiceNow. Okay and custom roles are the roles which we are going to create now. And some system administrator roles are basically a base system role but it is kind of an admin role like business underscore, rule underscore, admin, client underscore, script underscore, admin, these are basically system administrator roles. So this provides access to a user to work on a client script, to work on a business rules. And the read-only role like snc underscore, read underscore only, which is provided to a user if he wants that he can only read the things. Okay so these are basically four categorizations of roles. Okay base system role, special administrator role, custom role and read-only role. Okay so whatever role we will create from here that is basically a custom role. Okay so to create a role click on new. Once you click on here so you can give a role name. Let's say I am saying u underscore demo role. The best way is to use underscore so that you can identify that what is the custom role what is the base role. So the best practice is that whenever you are giving a role give it u underscore. In case if you are working in some different company then they must be having some specific format to define","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["12",{"pageContent":"that what is the custom role. Okay subscription required I am saying now, unspecified, okay application global. Application is basically that what all access, what all application must be having this role. Okay this is elevated privilege role. So elevated privilege role is basically a role which is given to a person for a particular time like half an hour for an hour. Okay so if I check this check box it means it's an elevated privilege role which admin can give to any person if he want that a person will perform a particular task for a specified time. Okay such as security underscore admin is basically an elevated privilege role which is given to a security admin for like an hour or I believe that for 45 minutes or 30 minutes so that he can perform his task after that role will automatically removed. Okay so I am not creating elevated privilege role. Okay I am saying description demo. I am clicking on save just a second. Once I saved it see a little list is appeared in front of us which is contain roles, applications with role, tables, custom application, users, groups. So once we assign this role to any user then that user name will get displayed over here. Once we assign this role to any group then","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["13",{"pageContent":"this role will displayed over here and if you want that if roles contains more roles then we can add more roles in this role. Okay let's say we have created a role A and then we want that role B, C, D, E will be come in this A role then we will create those role from over here by new and edit button and when we give this role to a particular person then automatically that role will also get assigned to that particular person. Okay means this role will become a parent and the other role will become a child which automatically assigned once we assign this role to a user. Application with role when we create a ACL or when we create an application then we decide it what kind of a role people must have those who can access that application then that will be useful and then that application will be displayed over here. So later on in upcoming videos we will be covering these things when we are creating ACLs when we are creating applications. Then I will give you a demo that how that particular things will be getting displayed over here. Okay so for now we will only talk about users and groups. Okay once I assign this role to user then user name will get displayed over here once I assign this role to group then group name","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["14",{"pageContent":"will be displayed over here. So this is role this is user so through this we have we come to know that how to create a user how to create a role. Now let's talk about groups. So type groups see under system administration same we have a groups I am opening this group in a new tab. So see here is a list of groups we already have 34 groups in the system. So if I talk about groups, group is basically a set of users who share the common purpose let's say service desk group okay for example if we are creating an incident ticket then the incident ticket will automatically assign to a service desk group or some task management group which are working on change management or change management group problem management groups okay then change management group is working on a change tickets problem management group is working on a problem tickets service desk is basically working on incident tickets okay so to create a group click on new button. So once we click on a new button we have this form we have to fill values in it okay so name of a group I am saying demo okay d e m or demo group and I am saying manager manager of a group I am saying he is the person who is taking care of this particular group he is a manager of this group","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["15",{"pageContent":"in case if there is some amount which has to be paid to a group for an hourly rate or something you can give the values over here okay group email id in case if you have let's say demo group demo.com and this parent of any group in case if you have then you can give a parent from here as well so I am not giving right now let's go to description okay and save so here once I save see we also have a rated list over here like roles if this group if we are assigning any role to this group then we have a role over here if you are assigning any member to this group then we have a member over here okay if we are creating any group under this group then we can create a group from here as well and we want to mention some skills for this group we can also mention those skills from here okay so now we have created user we have created role we have created group even though we have logged in through the user who does not have any role now so now as far as the use case we have created the user we have created the custom role we have created the group now we have to assign the role to the user directly okay so as I told you that this is a user if I want to assign a role to this user directly then what I will do I will create in this role see I click on edit so I am","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["16",{"pageContent":"assigning him a role which name is ITIL okay so ITIL is a very basic role which is assigned to a user if you want that the person can work on incident person can work on a change ticket person can work on other modules as well so ITIL role is best for that because ITIL is basically a out of box technician role I can say which is by default provided by ServiceNow it's basically a base system role ITIL so I am selecting ITIL over here so I am giving ITIL role to this user see and I am clicking on save once I click save see these roles are assigned to this user see so here this ITIL is displayed as false inherited and other roles are true means this ITIL role contain all these roles okay these are all roles are inherited by ITIL so once we assign this ITIL role to us these roles are automatically assigned to user okay so now this user which we have logged in here he is having a ITIL role so let's see earlier he is having access of only this 4 let's see how after assigning a ITIL role what all access this user must have okay so I am logging it out and logging it again the name is demo user and the password is 123 I click on login see so now page loads and see now he is having access of more applications now he is having access of like","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["17",{"pageContent":"this incident management he is having access of problem management he is having access of change management okay so in this way role works so that basically depends on role that what all access we want to give to a user what all tasks we want a user can perform so we can decide it by giving roles okay so in this way we can give a role to a user individual user okay but basically giving a role to a user directly is not a good practice so good practice is basically that assign a role to a group and then align that user to that group okay we will also do this in this video so okay so now here see if I refresh this page role page and if I refresh this group page see no impact in this related list everything is blank okay because I have not given this role to anyone I have not assigned this group to anyone okay so what I am going to do is now that I am assigning this role to this group so it will give us a understanding that how to assign a role to a group okay so let's see how to assign a role to a group so open the group click on edit you can directly assign a role from here see we have to assign you underscore demo so I am giving this this role to this group click on save see once I click on save see under related list we have a role you","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["18",{"pageContent":"underscore demo role which is given to this group let's refresh this role page see now here in related list you can see that this role is assigned to which group see here demo group okay so this way we can assign a role to a group now if we align a user to this group and what will happen see this is demo first user which I have created earlier so what I am going to do I am adding this user to this group so to adding a user navigate to group members click on edit and you can select a user from here let's say demo user see first demo and then click on save see when I click on save see group member first demo the user name is displayed under group member role is getting displayed over here now let's see I am refreshing this role then it will give us a user name as well see once I refresh this see user name also populated over here because we have given this role to a particular user through the group getting my point so now user is also getting displayed group is also getting displayed now this user must also having this role I am refreshing this user where is the role see this here it get added okay so in this way the best practice is that whenever we have to assign a role to a user what we will do we will add a user to that group the","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["19",{"pageContent":"group which is having that role okay so this group is having this role we added this user to this group automatically the role is assigned to a user okay so in this way we can add user to a group okay now let's see how we can remove role from user how we can remove role from group okay removing is same that if you want to remove a role from a group navigate to role click on edit select the role which you want to revoke move it back now this will become blank click on save see role is revoked now this group having a group member but does not have any role now so if I refresh this role page now see user is removed group is removed because the group does not have any role that means user does not have any role see so in this way we can remove the role as well and the same way we can also remove the role from the user click on edit select the role go back see role is revoked okay so in this way we can assign roles we can remove roles we can create user we can create roles we can create groups okay if we are creating a user that user will get saved in a table which name is sys underscore user okay the role which we are creating over here will get saved into sys underscore user underscore role okay and whatever group we are creating over here","metadata":{"loc":{"lines":{"from":1,"to":1}}}}],["20",{"pageContent":"will get saved into sys underscore user underscore group so these are basically the three tables where users roles and groups whatever we are creating in a system getting saved okay friends so friends this is all for this video so I hope this video helps you to understand that how we can create users roles and groups and how we can assign roles to groups and how we can assign roles to user okay friends so soon I will be posting a next video of this service now training session okay so this is all for this service now training session one so if you have not subscribed my channel then please do subscribe my channel and please do not forget to click on a bell icon so that you can receive a notification that what all videos I am going to post in future thank you friends have a nice day bye bye.","metadata":{"loc":{"lines":{"from":1,"to":1}}}}]]